import '../css/golf-rtl.css'
import '../css/golfstyle.css'
import '../css/reset.css'
import { Link } from 'react-router-dom';
import React, { useState, useEffect } from 'react';

export default function Rules(props) {
    const { setConnect, connect} = props;
    const handleOnChange = () => {
        setConnect(!connect);
    };
    return (
        <div>
            Rules תקנון האתר
            תנאי שימוש במערכת הזמנת TIME TEE –מועדון הגולף קיסריה
1 .מערכת הזמנת זמני משחק )"המערכת"( הינה מערכת המופעלת על גבי רשת האינטרנט
ומחייבת גישה לאינטרנט.
2 .המערכת הינה מערכת הזמנות ל Course Signature Dye Pete
ומגרש פאר 3.
3 .המערכת מנוהלת ע"י מועדון הגולף קיסריה )"מנהל המערכת"(.
4 .המערכת מיועדת לחברי מועדון הגולף קיסריה בלבד, אשר יהיו רשומים במערכת, בכפוף
להסכמתם לתנאי שימוש אלה ולחתימתם עליהם. יובהר כי הזמנת זמן יציאה לכל מי שאינו
מנוי תתבצע באמצעות הפרו שופ.
5 .המערכת הינה בשפות עברית ואנגלית.
6 .על מנת לבצע הזמנות באמצעות המערכת, יש להירשם במערכת רישום חד פעמי על ידי
מילוי פרטי זיהוי של החבר.
7 .כל כניסה למערכת תתבצע באמצעות שם משתמש וסיסמא. שם המשתמש והסיסמא
הינם אישיים ויימסרו רק לחברי המועדון באמצעות המייל או ע"י נציג המועדון באופן
פרונטאלי.
8 .השימוש במערכת מחייב זיהוי של השם הפרטי ושם המשפחה של חבר המועדון, אשר
יוצגו לכלל המשתמשים בעת השימוש במערכת. בעת הכניסה למערכת כל חבר מועדון יוכל
לצפות ברשימת ההזמנות השמית המלאה של כל הזמנות וזמני המשחק שנעשו עד לאותו
רגע. מובהר ומודגש כי, השימוש במערכת מחייב זיהוי של השם הפרטי ושם המשפחה של
חבר המועדון, וכן של זמן המשחק שהוזמן על ידו ו/או עבורו על ידי משתמש אחר, אשר יוצגו
לכלל המשתמשים בעת השימוש במערכת .
למען הסר ספק, בעת הכניסה למערכת כל חבר מועדון יוכל לצפות ברשימת ההזמנות
השמית המלאה של כל הזמנות וזמני המשחק שנעשו עד לאותו רגע.
9 .הזמנת זמן משחק ביום אשר אינו נכלל בתנאי המנוי, תחויב בתשלום דמי משחק,
בהתאם למחירון הנהוג במועדון.
10 .הגישה למערכת תתאפשר במסגרת תקופת המנוי והיא תחסם באופן אוטומטי עם סיום
תקופת המנוי )ככל והמנוי לא יחודש(.
11 .המערכת מאפשרת הזמנת זמן משחק אחד בכל יום לכל חבר מועדון )לא ניתן להזמין
יותר ממועד יציאה אחד בכל יום על אותו שם חבר(.
12 .חבר יוכל לבצע הזמנת זמן משחק עבורו ועבור חברי מועדון נוספים, בכפוף לקבלת
הסכמתם מראש ובכפוף להזנת שמות המשתמשים והסיסמאות האישיות של החברים
המשחקים עימו.
מסירת שם המשתמש והסיסמא האישית לחבר אחר, תעשה ביוזמת החבר ובאחריותו
הבלעדית.
13 .חבר מועדון אשר ביצע רישום עבור חברים המשחקים עימו אחראי להודיע להם כי
הרישום בוצע על ידו.
14 .ביטול הזמנת זמן יציאה – ביטול זמן משחק יחיד או קבוצתי חייב להיעשות 24
שעות לפני מועד המשחק לכל המאוחר על ידי השחקן עצמו. ביטול ביום המשחק ייעשה רק
על יד הפרו שופ.
15 .ניתן להזמין זמן יציאה למשחק לשני שחקנים ומעלה, אך יציאה למשחק תתאפשר
בהתאם להוראות המזניק ובהתאם לעומס במגרשים.
16 .מנהל המערכת רשאי לבצע שינויים בהזמנות שבוצעו על ידי חברי המועדון באמצעות
המערכת, תוך מתן הודעה של 48 שעות מראש לחבר המועדון שעבורו נעשה השינוי.
17 .הנהלת המועדון שומרת לעצמה את הזכות לבצע שינויים מעת לעת במועדי ותנאי
הרישום ולבצע שינויים במערכת ובתנאי שימוש אלה. למען הסר ספק למועדון קיימת הזכות
הבלעדית והמלאה לקבוע ו/או לשנות את זמני היציאה היומיים, לחסום זמני משחק מסוימים
לטובת פעילויות במועדון ולבצע כל עדכון/שינוי אחר הנחוץ לפעילות המועדון.
18 .תנאים אלה אינם גורעים מתנאי השימוש המפורטים באתר האינטרנט של החברה
לפיתוח קיסריה ומתקנון מועדון הגולף קיסריה אלא מוסיפים עליהם.
19 .נוהל הגעה למשחק – כל השחקנים חייבים להירשם בפרו שופ טרם תחילת המשחק.
על כל השחקנים להגיע לטי הראשון, עד 5 דקות לפני זמן המשחק שלהם.
20 .אי הגעה או איחור למשחק – שחקנים אשר אינם יופיעו בעמדת הסטרטר, עד 5 דקות
לפני זמן המשחק שלהם, יאבדו את תורם ויאלצו להמתין עד לזמן הפנוי הבא.
21 .הזמנת זמן משחק למנויים:
 בתנאי זהב- שלושה שבועות מראש
 ולשאר סוגי המנוי - שבועיים מראש
22 .במקרה של אי הופעה למשחק ללא ביטול מראש:
בפעם הראשונה – השחקן יקבל אזהרה.
בפעם השנייה – תמנע ממנו הזכות להזמין זמן משחק מראש למשך שבועיים.
בפעם השלישית ואילך – תמנע ממנו הזכות להזמנת זמן משחק מראש למשך חודשיים.
אני מסכים לאמור בתנאי השימוש לעיל ומאשר בזאת כי ידוע לי כי שמי, מועד המשחק
שהזמנתי וחברי הקבוצה עימה אשחק יופיעו במערכת המופעלת על גבי רשת האינטרנט.
הנני מתחייב כי לא תהא לי כל טענה ו/או תביעה ו/או דרישה
וכן הנני מוותר ויתור סופי ומוחלט על כל זכות ו/או טענה בקשר עם השימוש במערכת או כל
הנובע ממנו, לרבות בקשר עם פרסום שמי ו/או הפרטים המצוינים לעיל, כלפי
המועדון ו/או החברה לפיתוח קיסריה ו/או מי מטעמה או במקומה
            <Link to="/Login">
                <button >
                    חזור
                </button>
            </Link>

            <Link to="/Login">
                <button onClick={handleOnChange}>
                    אישור
                </button>
            </Link>
        </div>
    )
}
// import React, { useState, useEffect } from 'react';
// import { Link } from 'react-router-dom';
// import Footer from './Footer'
// import Header from './Header'

// //css
// import '../css/golf-rtl.css'
// import '../css/golfstyle.css'
// import '../css/reset.css'


// export default function Rules(props) {
//     const { setConnect, connect} = props;
    
//     const handleOnChange = () => {
//         setConnect(!connect);
//     };
//     return (
//         <div>
//             {/* <Header /> */}
//             Rules תקנון האתר

//             <Link to="/Login">
//                 <button >
//                     חזור
//                 </button>
//             </Link>

//             <Link to="/Login">
//                 <button onClick={handleOnChange}>
//                     אישור
//                 </button>
//             </Link>
//             <br></br>
//             <Footer/>
//         </div>
       
//     )
// }
